
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_workspace_id[0]
  * azurerm_role_assignment.slack_alerts_monitoring_reader_appinsights[0]
  * azurerm_role_assignment.slack_alerts_monitoring_reader_workspace[0]
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.finrem-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.finrem-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.finrem-vault.azurerm_key_vault_access_policy.product_team_access_policy
* Move
  * module.application_insights.azurerm_monitor_activity_log_alert.main => module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://finrem-prod.vault.azure.net/secrets/app-insights-connection-string/4a1deea50b864cc2bdcf5febb7d32e2b"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_workspace_id[0] will be created
  + resource "azurerm_key_vault_secret" "app_insights_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod/"
      + name                    = "app-insights-workspace-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "financial-remedy"
          + "builtFrom"           = "https://github.com/HMCTS/finrem-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#finrem-dev"
          + "description"         = "Workspace ID for Azure AD authenticated queries to Application Insights"
          + "environment"         = "production"
          + "managedBy"           = "Financial Remedy"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_role_assignment.slack_alerts_monitoring_reader_appinsights[0] will be created
  + resource "azurerm_role_assignment" "slack_alerts_monitoring_reader_appinsights" {
      + condition_version                = (known after apply)
      + description                      = "Allows slack alerts function app to read Application Insights metadata"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "407103df-1a98-4c25-af65-ae11daf1fef5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.Insights/components/finrem-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.slack_alerts_monitoring_reader_workspace[0] will be created
  + resource "azurerm_role_assignment" "slack_alerts_monitoring_reader_workspace" {
      + condition_version                = (known after apply)
      + description                      = "Allows slack alerts function app to query Application Insights workspace using Azure AD authentication"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "407103df-1a98-4c25-af65-ae11daf1fef5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
  # (moved from module.application_insights.azurerm_monitor_activity_log_alert.main)
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - finrem-prod" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - finrem-prod" -> "Application-Insights-daily-cap-reached-finrem-prod" # forces replacement
        tags                = {
            "application"         = "financial-remedy"
            "builtFrom"           = "https://github.com/HMCTS/finrem-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#finrem-dev"
            "environment"         = "production"
            "managedBy"           = "Financial Remedy"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels             = [] -> null
          - resource_groups    = [] -> null
          - resource_ids       = [] -> null
          - resource_providers = [] -> null
          - resource_types     = [] -> null
          - statuses           = [] -> null
          - sub_statuses       = [] -> null
            # (4 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.finrem-vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod/objectId/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod" -> "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod/" # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.finrem-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      ~ id                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod/objectId/b99ef436-d849-44d6-8835-f988b0af33e4" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod" -> "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod/" # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.finrem-vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod/objectId/f2ef9d16-488a-4b84-b433-3eb4225923cb" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod" -> "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.KeyVault/vaults/finrem-prod/" # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 4 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/finrem-prod/providers/Microsoft.Insights/components/finrem-prod"
        name                                  = "finrem-prod"
        tags                                  = {
            "application"         = "financial-remedy"
            "builtFrom"           = "https://github.com/HMCTS/finrem-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#finrem-dev"
            "environment"         = "production"
            "managedBy"           = "Financial Remedy"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":33,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->